Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <comment>(Упр)</comment>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроводитьНулевыеЗначения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтрокиТаблицыЦен</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЦен</name>
    <attributes>
      <name>ТипЦен</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("УстановкаЦенНоменклатуры_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатурыТипыЦен.ТипЦен,
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка КАК Док
		|ПОМЕСТИТЬ ТипыЦен
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТовары.Цена,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Артикул КАК Артикул,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Наименование КАК Номенклатура
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыЦен КАК ТипыЦен
		|		ПО УстановкаЦенНоменклатурыТовары.ТипЦен = ТипыЦен.ТипЦен
		|			И УстановкаЦенНоменклатурыТовары.Ссылка = ТипыЦен.Док";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
